Documents/ПеремещениеФигуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Document>
		<Properties>
			<Name>ПеремещениеФигуры</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.СостояниеПартии</xr:Item>
				<xr:Item>InformationRegister.ХодыИгроков</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партии</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Игрок</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фигура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Фигуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлеткаИсточник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клетки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлеткаНазначение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клетки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительноеДействие</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВзятиеФигуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/СостояниеПартии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>СостояниеПартии</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Фигура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Фигуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партии</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Клетка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клетки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ХодыИгроков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>ХодыИгроков</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клетки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Назначение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клетки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Фигура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Фигуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Игрок</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партии</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/ПеремещениеФигуры/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)

	ФигураНаКлеткеНазначения = Механика.НайтиФигуруПоКлетке(Дата, КлеткаНазначение, Партия);
	Если ЗначениеЗаполнено(ФигураНаКлеткеНазначения) Тогда
		Сообщить("Клетка назначения (" 
					+ Строка(КлеткаНазначение) 
					+ ") занята фигурой (" 
					+ Строка(ФигураНаКлеткеНазначения) 
					+ ") необходим документ Взятия фигуры.");   
		Отказ = Истина;
	КонецЕсли;

	
	//регистр СостояниеПартии
	Движения.СостояниеПартии.Записывать = Истина;
	Движение = Движения.СостояниеПартии.Добавить();
	Движение.Период = Дата;
	Движение.Партия = Партия;
	Движение.Фигура = Неопределено;
	Движение.Клетка = КлеткаИсточник;
		
	
	Движение = Движения.СостояниеПартии.Добавить();
	Движение.Период = Дата;
	Движение.Партия = Партия;
	Движение.Фигура = Фигура;
	Движение.Клетка = КлеткаНазначение;

	
	// регистр ХодыИгроков
	Движения.ХодыИгроков.Записывать = Истина;
	Движение = Движения.ХодыИгроков.Добавить();
	Движение.Период 	= Дата;
	Движение.Партия 	= Партия;
	Движение.Источник 	= КлеткаИсточник;
	Движение.Назначение = КлеткаНазначение;
	Движение.Фигура 	= Фигура;
	Движение.Игрок 		= Игрок;
	
	Если Отказ Тогда
		Если ЗначениеЗаполнено(ДополнительноеДействие) Тогда
			допДок = ДополнительноеДействие.Ссылка.ПолучитьОбъект();
			допДок.УстановитьПометкуУдаления(Истина);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если ПараметрыЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
		Если ЗначениеЗаполнено(ДополнительноеДействие) Тогда
			допДок = ДополнительноеДействие.Ссылка.ПолучитьОбъект();
			допДок.УстановитьПометкуУдаления(Истина);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
